Revit 2026 API

# FilteredElementIdIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ElementId Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As ElementId
	Get
```
```cpp
public:
virtual property ElementId^ Current {
	ElementId^ get ();
}
```
```fsharp
abstract Current : ElementId with get
override Current : ElementId with get
```

#### Property Value

ElementId

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

FilteredElementIdIterator Class

Autodesk.Revit.DB Namespace